a=10
b=3
print(a%b) #나머지는 %
print(a//b) #몫은 //
print("나누기 : {:f}".format(a/b))
print("제곱 : ",a**b)

c=10; d=20
e,f=3,4

# bool타입 : True, False
df = (100>10)
print(df)
# ==는 같다
bo1 = (100==10)
print(bo1)

str1="안녕하세요"
str2="10"
str3="10+40"
print(str3)
print("-"*34)
str4="""1. 동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라 만세
무궁화 삼천리 화려 강산
대한 사람 대한으로 길이 보전하세

2. 남산 위에 저 소나무 철갑을 두른 듯
바람 서리 불변함은 우리 기상일세
무궁화 삼천리 화려 강산
대한 사람 대한으로 길이 보전하세

3. 가을 하늘 공활한데 높고 구름 없이
밝은 달은 우리 가슴 일편단심일세
무궁화 삼천리 화려 강산
대한 사람 대한으로 길이 보전하세

4. 이 기상과 이 맘으로 충성을 다하여
괴로우나 즐거우나 나라 사랑하세
무궁화 삼천리 화려 강산
대한 사람 대한으로 길이 보전하세"""
print(str4)
print("{:.2f}".format(a/b))
print(2+2-(2*2)/2)

c="안녕"
d=5
print(c,d)

num1="10"
num2=5
print(int(num1)+num2)

n1=5
n2=11
print("{}+{}={}".format(n1,n2,n1+n2))


